Revit 2024 API
ElectricalEquipment.CircuitNamingSchemeId Property
 The CircuitNamingSchemeId used in the Electrical Equipment. The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ElementId CircuitNamingSchemeId { get; set; }
Visual Basic
Public Property CircuitNamingSchemeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ CircuitNamingSchemeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The circuit naming scheme id is invalid for the Electrical Equipment.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace